# Read Files

In [1]:
import pandas as pd

## .csv

In [2]:
df = pd.read_csv(r'C:\Users\EMMY\Desktop\Talento Tech\Analisis de datos\Clases\DB\datos.csv', sep = ';', decimal=',')
df.head()

          Ge          Cp  Ed       Im       Gp  Fc,,
0  Masculino        Moda  60  4497.63   820.12    24
1  Masculino        Moda  40  3371.45   961.18    19
2  Masculino  Tecnología  37  4871.87  1266.02    26
3   Femenino        Moda  25  6605.92   954.58    15
4  Masculino   Alimentos  48  4781.91  1098.94    22

In [3]:
df.columns

Index(['Ge', 'Cp', 'Ed', 'Im', 'Gp', 'Fc,,'], dtype='object')

### Renombrar columnas

In [4]:
df.rename(columns= {'Fc,,':'Fc'})
df.head()

          Ge          Cp  Ed       Im       Gp  Fc,,
0  Masculino        Moda  60  4497.63   820.12    24
1  Masculino        Moda  40  3371.45   961.18    19
2  Masculino  Tecnología  37  4871.87  1266.02    26
3   Femenino        Moda  25  6605.92   954.58    15
4  Masculino   Alimentos  48  4781.91  1098.94    22

## .txt

In [5]:
df2 = pd.read_csv(r'C:\Users\EMMY\Desktop\Talento Tech\Analisis de datos\Clases\DB\pulse.txt', sep= '\t')
df2.head()

   PuBefor  PuAfter Ran? Smokes?   Sex  Height  Weight  ActivityL
0       48       54   no     yes  male    68.0     150          0
1       54       56   no     yes  male    69.0     145          2
2       54       50   no      no  male    69.0     160          2
3       58       70  yes      no  male    72.0     145          2
4       58       58   no      no  male    66.0     135          3

## Excel

In [6]:
'''pip install openpyxl'''

archivo = r'C:\Users\EMMY\Desktop\Talento Tech\Analisis de datos\Clases\DB\notas_semestre.xlsx'
df = pd.read_excel(archivo, sheet_name=None) # sheet_name=None indica que se van a seleccionar todas las hojas. Se usa (sheet_name='nombre_de_la_hoja') En caso de que se desee seleccionar una sóla

data = df

Corte_1 = data['Corte1']
Corte_2 = data['Corte2']
Corte_3 = data['Corte3']